package ru.fls;

public class Main {

    public static void main(String[] args) {
        String inn = "111111111111";
        System.out.println(inn.length());
    }
        /**
        * Дана строка (возможно, пустая), состоящая из букв A-Z и пробелов, разделяющих слова:
            * "QUICK FOX   JUMPS    "
            * Нужно написать функцию, которая развернет слова:
            * "KCIUQ XOF   SPMUJ    "
            * И сгенерирует ошибку, если на вход пришла невалидная строка.
            */
    public static String revertWords(String str) {
    String reverted = null;

    return reverted;
    }

}
